In [3]:
import pandas as pd
import numpy as np

In [6]:
#Creating dictionary
ict_3={'one':pd.Series([1,2,3],index=['a','b','c']),
           'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
dict_3

{'one': a    1
 b    2
 c    3
 dtype: int64,
 'two': a    1
 b    2
 c    3
 d    4
 dtype: int64}

In [8]:
#Creating DataFrame with dictionary

df_2=pd.DataFrame(dict_3)
df_2

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [13]:
#filling zero in place to nan
df_2.fillna(0,inplace=True)

In [14]:
row=df_2.iloc[1]

In [15]:
#adding  row to columns
df_2.add(row,axis='columns')

   one  two
a  3.0  3.0
b  4.0  4.0
c  5.0  5.0
d  2.0  6.0

In [20]:
col=df_2['two']
print(col)
#subtracing column two to both the columns
df_2.sub(col,axis=0)

a    1
b    2
c    3
d    4
Name: two, dtype: int64

   one  two
a  0.0    0
b  0.0    0
c  0.0    0
d -4.0    0

In [22]:
#checking if dataframe is empty
df_2.empty

False

In [33]:
#creating dataframe with range
df_5=pd.DataFrame({'A':range(3),'B':range(1,4)})
df_5

   A  B
0  0  1
1  1  2
2  2  3

In [28]:
df_5.transform([lambda x:x**2,lambda x:x**3])

         A                 B
  <lambda> <lambda> <lambda> <lambda>
0        0        0        1        1
1        1        1        4        8
2        4        8        9       27

In [34]:
#converting dataframe with lambda function

df_5.transform({'A':lambda x:x**2,'B':lambda x:x**3})

   A   B
0  0   1
1  1   8
2  4  27

In [36]:
#using map function to apply lambda function

df_5['A'].map(lambda x: x**2)

0    0
1    1
2    4
Name: A, dtype: int64

In [38]:
#unique gives distinct values

df_5['A'].unique()

array([0, 1, 2], dtype=int64)

In [40]:
#value_counts count the number of each values
df_5['A'].value_counts()

2    1
1    1
0    1
Name: A, dtype: int64

In [41]:
# columns function gives the information about the column name.
df_5.columns

Index(['A', 'B'], dtype='object')

In [42]:
# isnull give the null boolean value
df_5.isnull()

       A      B
0  False  False
1  False  False
2  False  False

In [48]:
#creating dataframe
dict_6={'Store':[1,2,1,2],'Flavor':['Choc','Van','Straw',
                                   'Choc'],
       'Sales':[26,12,18,22]}
df_11=pd.DataFrame(dict_6)

In [54]:
by_store=df_11.groupby('Store')
by_store

In [55]:
# getting information with mean function
by_store.mean()

       Sales
Store
1         22
2         17

In [58]:
#getting information with sum function.

by_store.sum().loc[1]

Sales    44
Name: 1, dtype: int64

In [60]:
#gives the statistical value of the function

by_store.describe()

      Sales
      count  mean       std   min   25%   50%   75%   max
Store
1       2.0  22.0  5.656854  18.0  20.0  22.0  24.0  26.0
2       2.0  17.0  7.071068  12.0  14.5  17.0  19.5  22.0

In [74]:
# concating two DataFrame with concat function

df_12=pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6]},
                  index=[1,2,3])
df_13=pd.DataFrame({'A':[7,8,9],
                  'B':[10,11,12]},
                  index=[4,5,6])
pd.concat([df_12,df_13])

   A   B
1  1   4
2  2   5
3  3   6
4  7  10
5  8  11
6  9  12

In [105]:
#creating dataframe and merging on key with inner join
df_12=pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6],
                    'key':[1,2,3]})
df_13=pd.DataFrame({'A':[7,8,9],
                  'B':[10,11,12],
                  'key':[1,2,3]})



pd.merge(df_12, df_13, how='inner',on='key')

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [106]:
#creating dataframe and merging on key with left join
df_12=pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6],
                    'key':[1,2,3]})
df_13=pd.DataFrame({'A':[7,8,9],
                  'B':[10,11,12],
                  'key':[1,2,3]})



pd.merge(df_12, df_13, how='left',on='key')

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [107]:
#creating dataframe and merging on key with right join
df_12=pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6],
                    'key':[1,2,3]})
df_13=pd.DataFrame({'A':[7,8,9],
                  'B':[10,11,12],
                  'key':[1,2,3]})



pd.merge(df_12, df_13, how='right',on='key')

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [109]:
#creating dataframe and merging on key with outer join
df_12=pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6],
                    'key':[1,2,3]})
df_13=pd.DataFrame({'A':[7,8,9],
                  'B':[10,11,12],
                  'key':[1,2,3]})



pd.merge(df_12, df_13, how='outer',on='key')

   A_x  B_x  key  A_y  B_y
0    1    4    1    7   10
1    2    5    2    8   11
2    3    6    3    9   12

In [116]:
#joining two data with join function


df_12=pd.DataFrame({'A':[1,2,3],
                  'B':[4,5,6]},
                  index=[1,2,3])
df_13=pd.DataFrame({'C':[7,8,9],
                  'D':[10,11,12]},
                  index=[4,5,6])
df_12.join(df_13,how='outer')

     A    B    C     D
1  1.0  4.0  NaN   NaN
2  2.0  5.0  NaN   NaN
3  3.0  6.0  NaN   NaN
4  NaN  NaN  7.0  10.0
5  NaN  NaN  8.0  11.0
6  NaN  NaN  9.0  12.0

In [118]:
ice_df=pd.read_csv('https://raw.githubusercontent.com/derekbanas/NumPy-Tutorial/master/icecreamsales.csv')

In [119]:
ice_df

    Temperature  Sales
0            37    292
1            40    228
2            49    324
3            61    376
4            72    440
5            79    496
6            83    536
7            81    556
8            75    496
9            64    412
10           53    324
11           40    320

In [120]:
#counting the number of temperature and sales values in the dataset

ice_df.count()

Temperature    12
Sales          12
dtype: int64

In [121]:
# sum the values of temperature an sales values

ice_df.sum()

Temperature     734
Sales          4800
dtype: int64

In [122]:
# mean function get the mean for particular columns
ice_df['Sales'].mean()

400.0

In [123]:
ice_df['Sales'].mode()

0    324
1    496
dtype: int64

In [124]:
#min function gets the minimum values of the sales
ice_df['Sales'].min()

228

In [125]:
#max function gets the maximum values of the sales
ice_df['Sales'].max()

556

In [127]:
#product function multiply the whole function

ice_df['Sales'].product()

4582080946295013376

In [128]:
#get the standard deviation
ice_df['Sales'].std()

105.65122724408751

In [130]:
#get the variance 
ice_df['Sales'].var()

11162.181818181818

In [132]:
ice_df['Sales'].sem()

30.498882244794125

In [133]:
ice_df['Sales'].skew()

0.036552031682046925

In [134]:
ice_df['Sales'].kurt()

-1.2179973006069797

In [137]:
ice_df['Sales'].quantile(.5)

394.0

In [138]:
# is adds cumulativly

ice_df['Sales'].cumsum()

0      292
1      520
2      844
3     1220
4     1660
5     2156
6     2692
7     3248
8     3744
9     4156
10    4480
11    4800
Name: Sales, dtype: int64

In [139]:
# following is the cumulative product

ice_df['Sales'].cumprod()

0                     292
1                   66576
2                21570624
3              8110554624
4           3568644034560
5        1770047441141760
6      948745428451983360
7    -7453119918274248704
8    -7398664722117033984
9    -4537093350141984768
10    5721280450761064448
11    4582080946295013376
Name: Sales, dtype: int64

In [140]:
ice_df['Sales'].cummax()

0     292
1     292
2     324
3     376
4     440
5     496
6     536
7     556
8     556
9     556
10    556
11    556
Name: Sales, dtype: int64

In [141]:
ice_df['Sales'].cummin()

0     292
1     228
2     228
3     228
4     228
5     228
6     228
7     228
8     228
9     228
10    228
11    228
Name: Sales, dtype: int64

In [142]:

ice_df.describe()

       Temperature       Sales
count    12.000000   12.000000
mean     61.166667  400.000000
std      17.055169  105.651227
min      37.000000  228.000000
25%      46.750000  323.000000
50%      62.500000  394.000000
75%      76.000000  496.000000
max      83.000000  556.000000

In [143]:
df_2

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  0.0    4

In [144]:
df_2.agg(['mean','std'])

           one       two
mean  1.500000  2.500000
std   1.290994  1.290994